In [33]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

# convert lowercase column use str.lower()

In [3]:
df['Courses'] = df['Courses'].str.lower()
df

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

# convert lowercase column use apply()

In [34]:
df['Courses'] = df['Courses'].apply(str.lower)
df

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

# Use apply() & lambda function for lower

In [35]:
df['Courses'].apply(lambda x: x.lower())
df

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

# Use apply() & lambda function for upper

In [7]:
df['Courses']= df['Courses'].apply(lambda x: x.upper())
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

# Convert pandas column to lowercase use map()

In [74]:
df['Courses'] = df['Courses'].map(str.lower)
df

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

In [18]:
df['Courses'].str.len()

0    5
1    7
2    6
3    6
Name: Courses, dtype: int64

# strip

In [25]:
s = pd.Series(['1. Bat.  ', '2. Dog!\n', '3. fox?\t', np.nan])
print(s.str.strip())
print(s.str.lstrip())
print(s.str.rstrip())

0    1. Bat.
1    2. Dog!
2    3. fox?
3        NaN
dtype: object
0    1. Bat.
1    2. Dog!\n
2    3. fox?\t
3          NaN
dtype: object
0    1. Bat.
1    2. Dog!
2    3. fox?
3        NaN
dtype: object

# split

In [53]:
s = pd.Series(["this is my new pen",
               "https://www.w3resource.com/pandas/index.php",
               np.nan])
# s.apply(lambda x: print(x.split("")))
s.str.split("")

0    [, t, h, i, s,  , i, s,  , m, y,  , n, e, w,  ...
1    [, h, t, t, p, s, :, /, /, w, w, w, ., w, 3, r...
2                                                  NaN
dtype: object

# contains

In [58]:
df['Courses'].str.contains("spark")

0     True
1     True
2    False
3    False
Name: Courses, dtype: bool

# replace

In [67]:
df["Duration"].apply(lambda x: x.replace("days","weeks"))

0    30weeks
1    50weeks
2    40weeks
3    60weeks
Name: Duration, dtype: object

# startsWith

In [69]:
df["Courses"].apply(lambda x:x.startswith("p"))

0    False
1     True
2    False
3     True
Name: Courses, dtype: bool